Revit 2027 API
BuiltInFailures.LinkFailures.CannotModifyLinkedFile Property
 Shared Sites in the link ""%1!s!"" cannot be modified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotModifyLinkedFile { get; }
Public Shared ReadOnly Property CannotModifyLinkedFile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotModifyLinkedFile {
	FailureDefinitionId^ get ();
}
static member CannotModifyLinkedFile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace